app/controllers/splashes_controller.rb

	def index
		splashes = []
		@current_user.splashes.includes(:user_splashes, :author).find_each do |splash|
			user_splash = splash.user_splashes.find_by(:user_id => @current_user.id)

			splashes << {splashInfo: splash, userInfo: splash.author, userSplash: user_splash, reach: splash.user_splashes.count, score: splash.user_splashes.where(:favorited => true).count, id: splash.id, comments: splash.splash_comments.count}
---
SELECT  "splashes".* FROM "splashes" INNER JOIN "user_splashes" ON "splashes"."id" = "user_splashes"."splash_id" WHERE "user_splashes"."user_id" = $1  ORDER BY "splashes"."id" ASC LIMIT 1000  [["user_id", 12]]
SELECT "users".* FROM "users"  WHERE "users"."id" IN (8, 9, 10, 11)
SELECT COUNT(*) FROM "user_splashes"  WHERE "user_splashes"."splash_id" = $1 AND "user_splashes"."favorited" = 't'  [["splash_id", 1036]]